<a href='http://www.stepupanalytics.com'> <img src='stepup_picture.png' /></a>

# Loading Data in Pandas

In [6]:
import pandas as pd

#Loading the startup funding dataset from local system.
startup = pd.read_csv("startup_funding.csv")

startup.head()

,Sr No,Date,Startup_Name,Industry_Vertical,Sub_Vertical,Location,Investors,Investment_Type,Amount_in_USD
0,0,05-09-2019,FPL Technologies,FinTech,Financial Services,Pune,"Matrix Partners India, Sequoia India",Maiden Round,"45,00,000"
1,1,04-09-2019,Cashflo,FinTech,Invoice discounting platform and SME lending m...,Mumbai,SAIF Partners,Series A,"33,00,000"
2,2,04-09-2019,Digital F5,"Advertising, Marketing",Digital marketing firm,Mumbai,TIW Private Equity,Private Equity Round,"60,00,000"
3,3,04-09-2019,3rdFlix,SaaS,Education Technology,Hyderabad,Exfinity Venture Partners,pre-series A,"50,00,000"
4,4,04-09-2019,75F,IoT,Building automation system,Burnsville,Breakthrough Energy Ventures,Series A,"1,80,00,000"

In [7]:
startup.shape

(3009, 9)

# Sorting in Pandas

In [20]:
#sort the "industry_vertical" column in ascending order (It will return a series)

startup.Industry_Vertical.sort_values().head()

2286    360-degree view creating platform
2680              3D Printer Manufacturer
77                                     AI
2768                API Workflow platform
8                              Accounting
Name: Industry_Vertical, dtype: object

In [24]:
#sort the "industry_vertical" column in descending order (It will return a series)


startup.Industry_Vertical.sort_values(ascending=False).head()

2127                 visual search and discovery platform
2408    virtual reality, 3d simulation and stereoscopi...
2818                           usiness expense management
2258           us ticketing and fleet management platform
2521              solar products and services marketplace
Name: Industry_Vertical, dtype: object

In [26]:
# sorting the entire dataframe by "Industry_Vertical" Series, we will get a dataframe as output)

startup.sort_values("Industry_Vertical").head()

,Sr No,Date,Startup_Name,Industry_Vertical,Sub_Vertical,Location,Investors,Investment_Type,Amount_in_USD
2286,2322,09-10-2015,WoNoBo,360-degree view creating platform,NaN,Bangalore,Quikr,Private Equity,NaN
2680,2724,18-06-2015,Fracktal Works,3D Printer Manufacturer,NaN,Bangalore,Neoteric Infomatique Limited,Private Equity,"30,00,000"
77,78,01-02-2019,FleetX,AI,Logistics,Gurgaon,India Quotient and LetsVenture\\xe2\\x80\\x99s...,Pre Series A,Undisclosed
2768,2813,27-05-2015,Postman,API Workflow platform,NaN,Bangalore,Nexus Venture Partners,Seed Funding,"10,00,000"
8,8,03-09-2019,Vyapar App,Accounting,Mobile-based Accounting Software,Bengaluru,"India Quotient, Axilor Ventures",Series A,"50,00,000"

In [28]:
startup.sort_values("Industry_Vertical",ascending=False).head()

,Sr No,Date,Startup_Name,Industry_Vertical,Sub_Vertical,Location,Investors,Investment_Type,Amount_in_USD
2127,2162,15-12-2015,Streamoid,visual search and discovery platform,NaN,Bangalore / Palo Alto,Undisclosed,Seed Funding,"10,00,000"
2408,2444,22-09-2015,Virtual Logic,"virtual reality, 3d simulation and stereoscopi...",NaN,Bangalore,Swarnim Multiventures,Private Equity,"8,00,000"
2818,2865,23-04-2015,happay,usiness expense management,NaN,Bangalore,AngelPrime,Seed Funding,"5,00,000"
2258,2294,01-10-2015,Abhibus,us ticketing and fleet management platform,NaN,Hyderabad,Paytm (One97 communications),Private Equity,NaN
2521,2560,26-08-2015,EzySolare,solar products and services marketplace,NaN,Ahmedabad,Infuse Ventures,Seed Funding,NaN

In [35]:
# sorting the dataframe by using first 'Startup_Name' and 'Sub_Vertical'

startup.sort_values(['Startup_Name','Sub_Vertical']).head()

,Sr No,Date,Startup_Name,Industry_Vertical,Sub_Vertical,Location,Investors,Investment_Type,Amount_in_USD
32,33,10-07-2019,"""BYJU\\'S""",EdTech,Education,Bengaluru,Qatar Investment Authority,Private Equity Round,"15,00,00,000"
2957,3006,05-01-2015,#Fame,NaN,NaN,NaN,TO THE NEW Ventures,Private Equity,"1,00,00,000"
1207,1225,25-11-2016,121Policy,Consumer Internet,Online Insurance Platform,Kolkata,Xelpmoc,Seed Funding,NaN
166,168,12-07-2018,19th mile,IT,Artificial intelligence-based sales accelerati...,Gurugram,"Rishi Vasudev, Excelsior Investments, Ritesh V...",Seed/ Angel Funding,"1,80,000"
972,985,09-02-2017,1Crowd,Finance,Startup Crowd-funding platform,Mumbai,Ganesh Natarajan,Seed Funding,NaN

In [38]:
# sorting the dataframe by using first 'Startup_Name' and 'Sub_Vertical'

startup.sort_values(['Startup_Name','Sub_Vertical'],ascending=False).head()

,Sr No,Date,Startup_Name,Industry_Vertical,Sub_Vertical,Location,Investors,Investment_Type,Amount_in_USD
159,161,09-07-2018,zippserv,Consumer Internet,Online Platform For Risk-Assessment Services F...,Bengaluru,Info Edge (India) Ltd,Seed/ Angel Funding,"4,40,000"
693,696,06-06-2017,wayForward,Consumer Internet,Mobile app for Mental Health,New Delhi,"Harsh Mahajan, Farhan Naqvi, Sreepathy Viswana...",Seed Funding,"10,00,000"
2867,2914,18-03-2015,wWhere,NaN,NaN,NaN,Group of Angel Investors,Seed Funding,"2,00,000"
1810,1841,08-03-2016,vPhrase Analytics,Technology,AI based data analytics platform,Mumbai,"Apoorv Ranjan Sharma, Daud Ali and others",Seed Funding,NaN
1163,1181,04-11-2016,vImmune,Consumer Internet,Immunisation Management Platform,Bangalore,Undisclosed investor,Seed Funding,NaN

<a href="https://pandas.pydata.org/pandas-docs/version/0.19/generated/pandas.DataFrame.sort.html">**Sort function Documentation**</a>

<a href='https://pandas.pydata.org/pandas-docs/version/0.19/generated/pandas.DataFrame.sort.html'> </a>

# Filtering rows of a dataframe by using column value

**Aim** : We will create a list where each element is a dataframe row. The output will be **True** if a condition is satisfied, otherwise output is **False**.

In [62]:
startup_funds = []
for funding in startup.Amount_in_USD:
    if funding == 1000000:
        startup_funds.append(True)
    else:
        startup_funds.append(False)

In [63]:
# For checking how many elements are present in list
len(startup_funds)

3009

In [65]:
# Checking the initial elements of list
startup_funds[0:10]

[False, False, False, False, False, False, False, False, False, False]

In [78]:
# filtering values with specific column value

startup[startup.Location == "Bengaluru"].Startup_Name

5                Myelin Foundry
8                    Vyapar App
11                 MyPetrolPump
14                       Meesho
18                    Lo! Foods
21                    HungerBox
25             Rapido Bike Taxi
32                   "BYJU\\'S"
39                     NoBroker
42                Avail Finance
45                   Agara Labs
48                    Pratilipi
49                     Bolo App
54                 Ola Electric
55            Saahas Zero Waste
57                    BlackBuck
59                 Ather Energy
61                     GlowRoad
63                       Kuvera
64                      Medlife
68                         Setu
71                    Unacademy
74                     KrazyBee
76                      Increff
91                       GoDesi
93                       Meesho
94        Mobile Premier League
98                       DriveU
99                   CleanseCar
101                 HealthifyMe
                 ...
341                      happay
345                       Udaan
346                   Capillary
351                    Lollypop
354                       Credy
355             Predible Health
358                        WOTU
359                       DAAKI
362                       Tapzo
367                    Razorpay
368                      Streak
369                 pi Ventures
372                   ShareChat
375                    Skillate
377               AEON Learning
382                     Glassic
384                        Axio
389                      Scapic
391                     CureFit
392                    iNurture
407               Project Mudra
408                    Furlenco
410              Fracktal Works
415                     DocsApp
417                     Tea Box
418    Transversal Technologies
420                    HomeLane
425                 Springboard
428                  Your Quote
431                    EasyEcom
Name: Startup_Name, Length: 132, dtype: object

# Usage of loc and iloc method

### loc method is generally preferred when selection of rows and columns takes place with the help of **label**.

We can pass following types of values to it.

**Single label**, **list of labels**, **slice of labels**, **boolean series** and **colon**

In [85]:
# First 2 rows with last 3 columns

startup.loc[0:1,:]

,Sr No,Date,Startup_Name,Industry_Vertical,Sub_Vertical,Location,Investors,Investment_Type,Amount_in_USD
0,0,05-09-2019,FPL Technologies,FinTech,Financial Services,Pune,"Matrix Partners India, Sequoia India",Maiden Round,"45,00,000"
1,1,04-09-2019,Cashflo,FinTech,Invoice discounting platform and SME lending m...,Mumbai,SAIF Partners,Series A,"33,00,000"

In [94]:
# First 2 rows along with column values of 'Location' and 'Startup_Name'

startup.loc[0:3, ['Location','Startup_Name']]

    Location      Startup_Name
0       Pune  FPL Technologies
1     Mumbai           Cashflo
2     Mumbai        Digital F5
3  Hyderabad           3rdFlix

In [97]:
startup.loc[0:3, 'Startup_Name':'Location']

,Startup_Name,Industry_Vertical,Sub_Vertical,Location
0,FPL Technologies,FinTech,Financial Services,Pune
1,Cashflo,FinTech,Invoice discounting platform and SME lending m...,Mumbai
2,Digital F5,"Advertising, Marketing",Digital marketing firm,Mumbai
3,3rdFlix,SaaS,Education Technology,Hyderabad

In [108]:
startup.loc[startup.Industry_Vertical=='FinTech','Location']

0             Pune
1           Mumbai
19    Santa Monica
20         Gurgaon
50         Haryana
51        New York
Name: Location, dtype: object

### iloc method is preferred when we are selecting rows and columns through position of an integer.

The values passed to it are as follows:

**Single integer position**,**List of integer positions**,**Slice of integer positions**, **Colon**

In [114]:
# rows of integer position 0, 1 and 2. Columns of integer positions 0 and 4

startup.iloc[[3,4,5],[2,4]]

     Startup_Name                Sub_Vertical
3         3rdFlix        Education Technology
4             75F  Building automation system
5  Myelin Foundry             Deep-technology

In [115]:
startup.iloc[0:2,0:4]

   Sr No        Date      Startup_Name Industry_Vertical
0      0  05-09-2019  FPL Technologies           FinTech
1      1  04-09-2019           Cashflo           FinTech

<a href="https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html">**loc and iloc methods documentation**</a>

# Detecting duplicate values

In [116]:
#Detecting duplicate dates : So if two consecutive dates are same, then the output is true otherwise false

startup.Date.duplicated()

0       False
1       False
2        True
3        True
4        True
5        True
6        True
7        True
8       False
9       False
10       True
11       True
12       True
13       True
14      False
15      False
16       True
17      False
18       True
19       True
20      False
21      False
22       True
23      False
24       True
25      False
26      False
27       True
28      False
29      False
        ...
2979    False
2980     True
2981     True
2982     True
2983     True
2984     True
2985     True
2986     True
2987    False
2988     True
2989     True
2990    False
2991     True
2992     True
2993     True
2994    False
2995    False
2996     True
2997     True
2998     True
2999    False
3000     True
3001    False
3002    False
3003    False
3004    False
3005     True
3006    False
3007     True
3008    False
Name: Date, Length: 3009, dtype: bool

In [118]:
# Counting the duplicate items (Here for True we get a count of 1 and for False a count of 0)

startup.Date.duplicated().sum()

2000

In [119]:
# For checking if two consecutive rows have identical value

startup.duplicated().head(50)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
dtype: bool

In [120]:
# Counting the duplicated rows in whole dataset

startup.duplicated().sum()

0

<a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.duplicated.html">**duplicated() documentation**</a>